# GetInsulationSpecificationName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetInsulationSpecificationName Method
FabricationConfiguration Class See Also
---
Gets the insulation specification name from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetInsulationSpecificationName(
	int specId
)
```

Visual Basic
---
```text
Public Function GetInsulationSpecificationName ( _
	specId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetInsulationSpecificationName(
	int specId
)
```

# ### Parameters
specId
    Type: System..::..Int32 The insulation specification identifier.
# ### Return Value
The insulation specification name.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace